simple-auth-load-test.yaml
config:
  # target: 'http://localhost:3000'
  target: 'https://geo-jumper-backend.herokuapp.com'
  phases:
    - duration: 5 # five seconds
      arrivalRate: 20 # 20 fake users per second
scenarios:
  - flow:
    - post:
        url: "/signup"
        json:
          username: 'marioooonew'
          email: 'marionewnew@mario.com'
          password: 'mario'